[{"title":"From Howard Thurman to Muriel Lester, 30 January 1935","author":"Thurman, Howard","body":"\u003Cp\u003EMy dear Miss Lester:\u003C\/p\u003E\n\u003Cp class=\u0022indent\u0022\u003EI received your telegram last night, and I am arranging my plans so as to leave here late tonight arriving in Berkeley Sunday morning about seven-thirty. I take it that you are speaking Sunday morning, and I am wondering if it will be possible for us to have a good chat upon my arrival. At any rate, I shall go directly to Mr. Hunter’s from the railway station. I must get a train returning the same day. I hesitated a long time about making the decision to travel this great distance for so short a time. I wondered, too, whether it was quite ethical to have you spend such a huge sum of money in order that the trip would be possible. In the light of the total situation, however, I decided that perhaps we could both serve a larger good if the sacrifices were made at this time.\u003C\/p\u003E\n\u003Cp class=\u0022indent\u0022\u003EI was deeply moved by your letter, and I shall have several questions to raise with you.\u003C\/p\u003E\n\u003Cp class=\u0022indent\u0022\u003EA word about the expense. The round trip rate from here by rail is $160.60; the pullman is $21 each way, meals will cost an average of $3.25 a day going and coming, this will mean six days of train travel making a total of $19.50. This makes a total cost of $222.10, figuring it as closely as I can in the light of the handicaps of travel for one of my race. This is about $75 cheaper than by plane. I did not consider the plane, both because of the weather and because of the terrific difficulties involved due to my race.\u003C\/p\u003E\n\u003Cp class=\u0022indent\u0022\u003EIt will be a very great joy to meet you, and to have this opportunity of getting a profound insight into the heart of the problems of the Indian youth viewed through the heart of one who deserves to be called Christian.\u003C\/p\u003E\n\u003Cp class=\u0022indent\u0022\u003EI shall see you Sunday morning and shall be leaving in the afternoon of the same day. I don’t quite know how I am going to stand up under the terrific wear and tear of the continuous travel, in view of the fact that I have just returned from a long jaunt, but my interest will take care of that.\u003C\/p\u003E\n\u003Cp\u003ESincerely yours,\u003Cbr \/\u003E\n[\u003Cem\u003Eunsigned\u003C\/em\u003E]\u003Cbr \/\u003E\nHoward Thurman\u003Cbr \/\u003E\nMiss Muriel Lester\u003Cbr \/\u003E\n2901 Benvenue Avenue\u003Cbr \/\u003E\nBerkeley, California\u003C\/p\u003E\n","date":"1935-01-30","headnote":"\u003Cp\u003E\u003Cem\u003EThurman accepts Lester’s invitation to Berkeley, California, for further dialogue about India. In his letter Thurman also offers a telling glimpse into the difficulties of domestic travel for blacks.\u003C\/em\u003E\u003C\/p\u003E\n","nid":"452","recipient":"Lester, Muriel","source":"","nid_1":"https:\/\/thurmanpapersproject.org\/node\/452"}]